PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos_scheduler.c
/*
 * Include files
 */

#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <stddef.h>
#include <stdio.h>
#include <limits.h>
#include <assert.h>

#include "MPC5748G.h"
#include "typ_types.h"
#include "rtos_process.h"
#include "rtos_externalInterrupt.h"
#include "rtos_priorityCeilingProtocol.h"
#include "rtos_ivorHandler.h"
#include "rtos_systemMemoryProtectionUnit.h"
#include "rtos_scheduler_defSysCalls.h"
#include "rtos_scheduler.h"
#include "rtos_kernelInstanceData.h"
#include "rtos_runTask.h"
#include "rtos.h"


/*
 * Defines
 */

/* The assembler code doesn't have access to all defines found in the sphere of C code.
   This makes it essential to have a cross check here, were we can access the definitions
   from both spheres. */
#if RTOS_NO_ERR_PRC != RTOS_NO_CAUSES_TASK_ABORTION                                     \
    ||  RTOS_ERR_PRC_PROCESS_ABORT != RTOS_CAUSE_TASK_ABBORTION_PROCESS_ABORT           \
    ||  RTOS_ERR_PRC_MACHINE_CHECK != RTOS_CAUSE_TASK_ABBORTION_MACHINE_CHECK           \
    ||  RTOS_ERR_PRC_DEADLINE != RTOS_CAUSE_TASK_ABBORTION_DEADLINE                     \
    ||  RTOS_ERR_PRC_DI_STORAGE != RTOS_CAUSE_TASK_ABBORTION_DI_STORAGE                 \
    ||  RTOS_ERR_PRC_SYS_CALL_BAD_ARG  != RTOS_CAUSE_TASK_ABBORTION_SYS_CALL_BAD_ARG    \
    ||  RTOS_ERR_PRC_ALIGNMENT != RTOS_CAUSE_TASK_ABBORTION_ALIGNMENT                   \
    ||  RTOS_ERR_PRC_PROGRAM_INTERRUPT  != RTOS_CAUSE_TASK_ABBORTION_PROGRAM_INTERRUPT  \
    ||  RTOS_ERR_PRC_FPU_UNAVAIL != RTOS_CAUSE_TASK_ABBORTION_FPU_UNAVAIL               \
    ||  RTOS_ERR_PRC_TBL_DATA != RTOS_CAUSE_TASK_ABBORTION_TBL_DATA                     \
    ||  RTOS_ERR_PRC_TBL_INSTRUCTION != RTOS_CAUSE_TASK_ABBORTION_TBL_INSTRUCTION       \
    ||  RTOS_ERR_PRC_SPE_INSTRUCTION != RTOS_CAUSE_TASK_ABBORTION_SPE_INSTRUCTION       \
    ||  RTOS_ERR_PRC_USER_ABORT != RTOS_CAUSE_TASK_ABBORTION_USER_ABORT                 \
    ||  RTOS_ERR_PRC_RESERVED != RTOS_CAUSE_TASK_ABBORTION_RESERVED                     \
    ||  RTOS_SPR_PIR != SPR_PIR
# error Inconsistencies found between definitions made in C and assembler code
#endif

/* The user API header file rtos.h doesn't recursively include all headers of all
   implementing files. Therefore it needs to make some assumptions about basically variable
   but normally never changed constants. These assumptions need of course to be double
   checked. We do this here at compile time of the RTOS. */
#if RTOS_IDX_SC_TRIGGER_EVENT != RTOS_SYSCALL_TRIGGER_EVENT
# error Inconsistent definitions made in C modules and RTOS API header file rtos.h
#endif

#if RTOS_MAX_LOCKABLE_TASK_PRIORITY >= RTOS_MAX_TASK_PRIORITY
# error Suspicious task priority configuration
#endif

/** A pseudo event ID. Used to register a process initialization task using registerTask(). */
#define EVENT_ID_INIT_TASK     (UINT_MAX)


/*
 * Local type definitions
 */


/*
 * Local prototypes
 */

/** Hook function for ISRs and system calls: Some tasks of triggered events are possibly to
    be executed (depending on priority rules).\n
      Note, this function is not publically declared although it is global. It is called
    externally only from the assembly code, which can't read public declarations in header
    files.
      @param pEvent
    The first event in global list, which is to be considered for scheduling. */
void rtos_osProcessTriggeredEvents(rtos_eventDesc_t *pEvent);


/*
 * Data definitions
 */

/** A constant array holding the index of a PIT timer for each core on the chip. This is
    just the configuration data and it leaves it open, whether the core runs the RTOS and
    whether the index is used at all. */
static const unsigned int rtos_idxRtosTimerAry[RTOS_MAX_NO_CORES] =
    { [0] = RTOS_CORE_0_IDX_OF_PID_TIMER
    , [1] = RTOS_CORE_1_IDX_OF_PID_TIMER
    , [2] = RTOS_CORE_2_IDX_OF_PID_TIMER
    };


/*
 * Function implementation
 */

/**
 * Helper: Resolve the linear event index used at the API into the actual object. The
 * mapping is not trivial since the events are internally ordered by priority.
 *   @return
 * Get the event object by reference.
 *   @param idEvent
 * The mapping is not essential for the kernel. It implies avoidable run-time effort. The
 * only reason for having the mapping is a user friendly configuration API. If we had a
 * configuration tool (similar to OSEK OIL tool) or if we would put some documented
 * restrictions on the configuration API then we could have a implicit one-by-one mapping
 * without any loss of functionality.
 *   @remark
 * This function must be called from a supervisor context only. It makes use of priviledged
 * instructions.
 */
static ALWAYS_INLINE rtos_eventDesc_t *getEventByID(unsigned int idEvent)
{
    const rtos_kernelInstanceData_t * const pIData = rtos_osGetInstancePtr();
    assert(idEvent < pIData->noEvents);
    return pIData->mapEventIDToPtr[idEvent];

} /* End of getEventByID */



/**
 * Helper: Resolve the linear, zeror based, internally used array index into the actual
 * event object. This function is trivial and intended more for completeness: it
 * complements the other function getEventByID().
 *   @return
 * Get the event object by reference.
 *   @param idxEvent
 * Index of event object in the array rtos_getInstancePtr()->eventAry.
 *   @remark
 * This function must be called from a supervisor context only. It makes use of priviledged
 * instructions.
 */
static ALWAYS_INLINE rtos_eventDesc_t *getEventByIdx(unsigned int idxEvent)
{
    rtos_kernelInstanceData_t * const pIData = rtos_osGetInstancePtr();
    return &pIData->eventAry[idxEvent];

} /* End of getEventByIdx */




/**
 * Registration of a task. Normal, event activated tasks and process initialization tasks
 * can be registered for later execution. This can be both, user mode tasks and operating
 * system tasks. This function is repeatedly called by the application code as often as
 * tasks are required.\n
 *   All calls of this function need to be done prior to the start of the kernel using
 * rtos_osInitKernel().
 *   @return
 * \a rtos_err_noError (zero) if the task could be registered. The maximum number of normal
 * tasks is limited to #RTOS_MAX_NO_TASKS (regardless, how they are distributed among
 * processes). The maximum number of initialization tasks is one per process or for the OS.
 * If the limit is exceeded or if the task specification is invalid then the function
 * returns a non zero value from enumeration \a rtos_errorCode_t.\n
 *   An assertion in the calling code is considered appropriate to handle the error because
 * it'll always be a static configuration error.
 *   @param idEvent
 * Any (normal) task is activated by an event and a task without related event is useless.
 * This call associates the registered task with an already created event. See
 * rtos_osCreateEvent().\n
 *   If a process or OS initialization task is registered, then \a idEvent is set to
 * #EVENT_ID_INIT_TASK. It is allowed not to register an init task for a process or
 * for the OS but it is not possible to register more than one (or to re-register an) init
 * task for a given process or the OS.\n
 *   The order of registration of several tasks with one and the same event matters. The
 * tasks will be acivated in order of registration whenever the event becomes due or is
 * triggered by software.\n
 *   The order of registration doesn't matter for initialization tasks! The OS
 * initialization task is served first. Processes are always initialized in order of rising
 * process ID. The most privileged process is served last and can thus override descisions
 * of its less privileged predecessors.
 *   @param addrTaskFct
 * The task function, which is run in process \a PID every time, the event \a idEvent
 * triggers.
 *   @param PID
 *   The process the task belongs to by identifier. We have a fixed, limited number of four
 * processes (#RTOS_NO_PROCESSES) plus the kernel process, which has ID 0. The range of
 * process IDs to be used here is 0 .. #RTOS_NO_PROCESSES.\n
 *   @param tiTaskMaxInUs
 * Time budget for the user task in Microseconds. This budget is granted for each
 * activation of the task, i.e. each run of \a addrTaskFct(). The budget relates to
 * deadline monitoring, i.e. it is a world time budget, not an execution time budget.\n
 *   Deadline monitoring is supported up to a maximum execution time of
 * #RTOS_TI_DEADLINE_MAX_IN_US Microseconds.\n
 *   A value of zero means that deadline monitoring is disabled for the task.\n
 *   There's no deadline monitoring for OS tasks. If \a PID is zero then \a
 * tiTaskMaxInUS meeds to be zero, too.
 *   @remark
 * Never call this function after the call of rtos_osInitKernel()!
 *   @remark
 * This function must be called by trusted code in supervisor mode only.
 */
static rtos_errorCode_t registerTask( unsigned int idEvent
                                    , uintptr_t addrTaskFct
                                    , unsigned int PID
                                    , unsigned int tiTaskMaxInUs
                                    )
{
    rtos_kernelInstanceData_t * const pIData = rtos_osGetInstancePtr();

    /* The scheduler should be in halted state. */
    if(pIData->tiOsStep != 0)
        return rtos_err_configurationOfRunningKernel;

    /* The event need to be created before the task can be registered. */
    if(idEvent >= pIData->noEvents  &&  idEvent != EVENT_ID_INIT_TASK)
        return rtos_err_badEventId;

    /* The process ID needs to be in the fixed and limited range. */
    if(PID > RTOS_NO_PROCESSES)
        return rtos_err_badProcessId;

