PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos_scheduler.c
    /* The number of runtime tasks is constraint by compile time configuration. */
    if(pIData->noTasks >= RTOS_MAX_NO_TASKS  &&  idEvent != EVENT_ID_INIT_TASK)
        return rtos_err_tooManyTasksRegistered;

    /* The event's field noTasks is of smaller size. */
    if(idEvent != EVENT_ID_INIT_TASK
       &&  getEventByIdx(idEvent)->noTasks >= UINT_T_MAX(((rtos_eventDesc_t*)NULL)->noTasks)
      )
    {
        return rtos_err_tooManyTasksRegistered;
    }

    /* Task function not set. */
    if(addrTaskFct == 0)
        return rtos_err_badTaskFunction;

    /* Check execution budget: There's an upper boundary for user tasks and OS task cannot
       have deadline monitoring at all. */
    if(tiTaskMaxInUs > RTOS_TI_DEADLINE_MAX_IN_US  ||  PID == 0  &&  tiTaskMaxInUs > 0)
        return rtos_err_taskBudgetTooBig;

    /* We make the distinction between normal runtime tasks and initialization tasks. */
    /// @todo Afterwards, it looks like a strange design decision to make this distinction.
    // Why not having a block of consecutive tasks in the array of all tasks? The required
    // sorting algorithms are anyway in place. We would reuse same code and could easily
    // offer an unbounded number of initialization tasks per process. They were associated
    // with a virtual event, meaning the system initialization.
    /// @todo See other TODO, which proposes more or less the same for process related idle
    // tasks
    if(idEvent == EVENT_ID_INIT_TASK)
    {
        /* An initialization task must not be configured repeatedly for one and the same
           process. */
        const unsigned int idxP = PID;
        assert(idxP < sizeOfAry(pIData->initTaskCfgAry));
        if(pIData->initTaskCfgAry[idxP].addrTaskFct != 0)
            return rtos_err_initTaskRedefined;

        pIData->initTaskCfgAry[idxP].addrTaskFct = addrTaskFct;
        pIData->initTaskCfgAry[idxP].tiTaskMax = RTOS_TI_US2TICKS(tiTaskMaxInUs);
        pIData->initTaskCfgAry[idxP].PID = PID;
    }
    else
    {
        /* Add the new runtime task to the array. All tasks associated with an event need
           to form a consecutive list. We need to find the right location to insert the
           task and we need to consider an update of all events with refer to tasks with
           higher index. */
        rtos_eventDesc_t * const pEvent = getEventByID(idEvent);
        rtos_taskDesc_t *pNewTaskDesc;
        if(pEvent->taskAry == NULL)
        {
            /* First task of given event, we append a new sequence of tasks to the end of
               the task list so far. Done. */
            pEvent->taskAry = pNewTaskDesc = &pIData->taskCfgAry[pIData->noTasks];

            /* Associate the task with the specified event. */
            pEvent->noTasks = 1;
        }
        else
        {
            /* This is a further task for the event. We will have to shift the tasks in the
               task list to still have a consecutive sequence of tasks for the event. */
            pNewTaskDesc = (rtos_taskDesc_t*)pEvent->taskAry + pEvent->noTasks;

            /* The event's task sequence can be in the middle of the task list. So need to
               check if we have to move some rightmost list entries. */
            rtos_taskDesc_t *pTaskCfg = &pIData->taskCfgAry[pIData->noTasks];
            assert(pIData->noTasks >= 2  ||  pTaskCfg <= pNewTaskDesc);
            for(; pTaskCfg>pNewTaskDesc; --pTaskCfg)
                *pTaskCfg = *(pTaskCfg-1);

            /* Update the reference to the task sequence for all events, which still point
               to the shifted area of the task list. Note, that the events don't have a
               particular order with respect to the user specified index. (Instead, they
               are sorted by priority.) */
            unsigned int idxEv;
            for(idxEv=0; idxEv<pIData->noEvents; ++idxEv)
            {
                rtos_eventDesc_t * const pCheckedEvent = getEventByIdx(idxEv);
                if(pCheckedEvent != pEvent  &&  pCheckedEvent->taskAry >= pNewTaskDesc)
                    ++ pCheckedEvent->taskAry;
            }

            /* Associate the task with the specified event. */
            ++ pEvent->noTasks;
            assert(pEvent->noTasks > 0);
        }

        /* Fill the new task descriptor. */
        pNewTaskDesc->addrTaskFct = addrTaskFct;
        pNewTaskDesc->tiTaskMax = RTOS_TI_US2TICKS(tiTaskMaxInUs);
        pNewTaskDesc->PID = PID;
        ++ pIData->noTasks;
        assert(pIData->noTasks > 0);
    }

    return rtos_err_noError;

} /* End of registerTask */




/**
 * Trigger an event to activate all associated tasks.\n
 *   This function implements the operation. It is called from two API functions, one for
 * OS code and one for user code. See rtos_osTriggerEvent() and rtos_triggerEvent() for
 * more details.
 *   @return
 * Get \a true if event could be triggered, \a false otherwise.
 *   @param pEvent
 * The event to trigger by reference.
 *   @param hasTaskParam
 * Individual task parameter value for each activation of the tasks of thes event are not
 * always used. They are not used for regular, timer triggered events. However the code in
 * this function is shared between timer events and others. Specify \a true if \a taskParam
 * should be adopted by the event and \a false if it should be ignored.\n
 *   Only use Boolean literals but no Boolean expression, when calling this function: It is
 * an inline implementation. The entire code for supporting \a taskParam will be discarded
 * at compile time if the Boolean literal \a false is passed in and at least the decision
 * logic is discarded if it is a \a true.
 *   @param taskParam
 * This is the value of the variable argument for all the associated task function, when
 * they will be called later.
 *   @param isInterrupt
 * This function submits an immediate call of the scheduler if an event of accordingly high
 * priority is triggered. However, this call is postponed if we are currently still inside
 * an interrupt. This flag tells about.\n
 *   Note, this is an inline function. The complete is-interrupt decision code will be
 * discarded if a Boolean literal can be passed in - as it is for the call from the timer
 * ISR and the user task API. Only the OS API, which is shared between ISRs and OS tasks
 * will really contain the run-time decision code.
 */
static ALWAYS_INLINE bool osTriggerEvent( rtos_eventDesc_t * const pEvent
                                        , const bool hasTaskParam
                                        , uintptr_t taskParam
                                        , const bool isInterrupt
                                        )
{
    rtos_kernelInstanceData_t * const pIData = rtos_osGetInstancePtr();

    bool success;

    /* If the function is called from an ISR then we need to use enter/leaveCriticalSection
       to create the critical section. This makes the function available to preemptable and
       non-preemptable ISRs. When called from a task it would be sufficient to
       unconditionally suspend and resume interrupt processing. (If a task has suspended
       the interrupts and then calls this function, which temporarily enables all
       interrupts then it'll surely be a design error in the logic of the calling task.)\n
         Generally using enter/leaveCriticalSection is never wrong but means useless
       overhead for calls from preemptable ISRs or tasks. The current construct of using
       one and the same inline implementation at all the different calling situations
       cannot avoid the useless overhead. We have a trade-off between avoidance of
       undesired code duplication and of useless overhead in all calling situations. */
    const uint32_t stateIrqAtEntry = rtos_osEnterCriticalSection();
    if(pEvent->state == evState_idle)
    {
        /* Operation successful. Event can be triggered. */
        pEvent->state = evState_triggered;
        success = true;
        
