PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos_scheduler.c
        /* Set the task function argument for this activation. (And for all future
           activations of a regular, time triggered event if such an event should be
           addressed from service rtos_triggerEvent().) */
        if(hasTaskParam)
            pEvent->taskParam = taskParam;
        
        /* Setting an event means a possible context switch to another task. It depends on
           priority and interrupt state. If so, we need to run the scheduler.
             It is not necessary to run the scheduler if the triggered event has a priority
           equal to or lower than the priority of the currently processed event. In this
           case the scheduler would anyway not change the current task right now.
             The scheduler must not be called if this function is called from inside an
           ISR. ISRs will call the function a bit later, when the interrupt context is
           cleared and only if they serve the root level interrupt (i.e. not from a nested
           interrupt). In this case calling rtos_osProcessTriggeredEvents() is postponed and
           done from the assembly code (IVOR #4 handler) but not yet here. The global flag
           pIData->pNextEventToSchedule is set to command this. */
        if(pEvent->priority > pIData->currentPrio)
        {
            if(isInterrupt)
            {
                /* Postpone the scheduler invocation till the end of the interrupt
                   handler. This is indicated by a global pointer, which has an initial
                   value that means "no pending event".
                     The next scheduler invocation will start with serving this event. We
                   must not move it towards less prior events - ISRs could trigger several
                   events and the scheduler needs to start with the one of highest
                   priority. The array of events is sorted in order of decreasing priority,
                   therefore a simple comparison is sufficient. */
                if(pEvent < pIData->pNextEventToSchedule)
                    pIData->pNextEventToSchedule = pEvent;
            }
            else
            {
                /* We will get here only if the function is called from a task (OS or user
                   through system call) */
                
                /* The recursive call of the scheduler is immediately done. We return here
                   only after a couple of other task executions.
                     Note, the critical section, we are currently in, will be left by the
                   recursively invoked scheduler as soon as it finds a task to be launched.
                   However, it'll return in a new critical section - which is the one we
                   leave at the end of this function. */
                rtos_osProcessTriggeredEvents(pEvent);
            }
        }
        else
        {
            /* Two possibilities to get here:
                 - The event's priority is in the scope of the currently operating scheduler.
               No need to immediately start a recursive scheduler or to postpone this start.
                 - The event has a priority, which is lower than the current one but still
               higher than the base priority of the currently processed event. This situation
               occurs if the current priority had been raised by means of the PCP API.
               Scheduling of the triggered event is postponed till the PCP API lowers the
               priority again. There's no simple way to store the information whether/which
               event to serve when PCP will later lower the priority:
                 "Whether" depends on the not yet known information how far PCP will be asked
               to lower the priority.
                 "Which" would require a recursive data storage. A normal, preempting
               scheduler could launch tasks, which in turn raise their priority by PCP.
                 Therefore, we need to dynamically find out later as part of the PCP
               priority lowering operation. Nothing to store here. */
        }
    }
    else
    {
        /* Processing of event has not completed yet, associated tasks have not
           all terminated yet. */

        /* Counting the loss events requires a critical section. The loss counter can be
           written concurrently from another task invoking rtos_osTriggerEvent() or by the
           timer controlled scheduler. */
        const unsigned int noActivationLoss = pEvent->noActivationLoss + 1;
        if(noActivationLoss > 0)
            pEvent->noActivationLoss = noActivationLoss;

        success = false;
    }
    rtos_osLeaveCriticalSection(stateIrqAtEntry);
    
    return success;

} /* End of osTriggerEvent */




/**
 * Process the conditions that trigger events. The events are checked for becoming
 * meanwhile due and the associated tasks are made ready in case by setting the according
 * state in the event object. However, no tasks are already started in this function.
 */
static inline void checkEventDue(void)
{
    const rtos_kernelInstanceData_t * const pIData = rtos_osGetInstancePtr();
    
    rtos_eventDesc_t *pEvent = getEventByIdx(0);

    /* We iterate the events in order for decreasing priority. */
    const rtos_eventDesc_t * const pEndEvent = pIData->pEndEvent;
    while(pEvent < pEndEvent)
    {
        if(pEvent->tiCycleInMs > 0)
        {
            if((signed int)(pEvent->tiDue - pIData->tiOs) <= 0)
            {
                /* Trigger the event or count an activation loss error. */
                osTriggerEvent(pEvent
                              , /* hasTaskParam */ false
                              , /* taskParam */ 0 /* value doesn't care */
                              , /* isInterrupt */ true
                              );

                /* Adjust the due time.
                     Note, we could queue task activations for cyclic tasks by not adjusting
                   the due time. Some limitation code would be required to make this safe. */
                pEvent->tiDue += pEvent->tiCycleInMs;

            } /* End if(Event is due?) */
        }
        else
        {
            /* Non regular events: nothing to be done. These events are triggered only by
               explicit software call of rtos_triggerEvent(). */

