PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos_scheduler.c
        } /* End if(Timer or application software activated task?) */

        /* Proceed with next event. */
        ++ pEvent;

    } /* End While(All configured events) */

} /* End of checkEventDue */



/**
 * The OS default timer handler. In function rtos_osInitKernel(), it is associated with the
 * PIT0 interrupt. You must not call this function yourself. The routine is invoked once
 * every #RTOS_CLOCK_TICK_IN_MS Milliseconds and triggers most of the scheduler decisions.
 * The application code is expected to run mainly in regular tasks and these are activated
 * by this routine when they become due. All the rest is done by the interrupt controller
 * INTC.
 *   @remark
 * The INTC priority at which this function is executed is configured as
 * #RTOS_KERNEL_IRQ_PRIORITY.
 */
static void onOsTimerTick(void)
{
    rtos_kernelInstanceData_t * const pIData = rtos_osGetInstancePtr();
    
    /* Update the system time. */
    pIData->tiOs += pIData->tiOsStep;

    /* The scheduler is most simple; the only condition to make a task ready is the next
       periodic due time. The task activation is left to the pseudo-software-interrupt,
       which is raised either by true interrupts (if they use setEvent) or by system calls,
       which may cause a task switch. */
    checkEventDue();

    /* RM 51.4.11, p. 2738f: Acknowledge the timer interrupt in the causing HW device. */
    const unsigned int idxTimer = rtos_idxRtosTimerAry[rtos_osGetIdxCore()];
    PIT->TIMER[idxTimer].TFLG = PIT_RTI_TFLG_TIF(1);

} /* End of onOsTimerTick */



/**
 * Processing a triggered event means to execute all associated tasks. If the scheduler
 * finds an event to be processed as next one, then it'll call this function to run the
 * tasks.
 *   @param pEvent
 * The event by reference, whose tasks are to be executed one after another.
 */
static inline void launchAllTasksOfEvent(const rtos_eventDesc_t * const pEvent)
{
    const rtos_taskDesc_t *pTaskConfig = &pEvent->taskAry[0];
    unsigned int u = (unsigned int)pEvent->noTasks;
    const uintptr_t taskParam = pEvent->taskParam;
    while(u-- > 0)
    {
        if(pTaskConfig->PID > 0)
            rtos_osRunTask(pTaskConfig, taskParam);
        else
            ((void (*)(uintptr_t))pTaskConfig->addrTaskFct)(taskParam);

        ++ pTaskConfig;

    } /* End while(Run all tasks associated with the event) */

} /* End of launchAllTasksOfEvent */



/**
 * Initialize a timer and associate its wrap-around interrupt with the main clock tick
 * function of the RTOS, onOsTimerTick(). The wrap-around cycle frequency of the timer
 * determines the time resolution of the RTOS operations.\n
 *   The wrap-around cycle time is a compile-time configuration item, see
 * #RTOS_CLOCK_TICK_IN_MS for more details.
 */
static void initRTOSClockTick(void)
{
    _Static_assert( RTOS_CLOCK_TICK_IN_MS >= 1  &&  RTOS_CLOCK_TICK_IN_MS <= 35791
                  , "RTOS clock tick configuration is out of range"
                  );
    _Static_assert( RTOS_RUN_SAFE_RTOS_ON_CORE_0_Z4A == 0
                    ||  RTOS_CORE_0_IDX_OF_PID_TIMER >= 1 && RTOS_CORE_0_IDX_OF_PID_TIMER <= 15
                  , "Bad configuration of PIT timers as clock source for safe-RTOS"
                  );
    _Static_assert( RTOS_RUN_SAFE_RTOS_ON_CORE_1_Z4B == 0
                    ||  RTOS_CORE_1_IDX_OF_PID_TIMER >= 1 && RTOS_CORE_1_IDX_OF_PID_TIMER <= 15
                  , "Bad configuration of PIT timers as clock source for safe-RTOS"
                  );
    _Static_assert( RTOS_RUN_SAFE_RTOS_ON_CORE_2_Z2 == 0
                    ||  RTOS_CORE_2_IDX_OF_PID_TIMER >= 1 && RTOS_CORE_2_IDX_OF_PID_TIMER <= 15
                  , "Bad configuration of PIT timers as clock source for safe-RTOS"
                  );
    _Static_assert( RTOS_RUN_SAFE_RTOS_ON_CORE_0_Z4A == 0
                    ||  RTOS_RUN_SAFE_RTOS_ON_CORE_1_Z4B == 0
                    ||  RTOS_CORE_0_IDX_OF_PID_TIMER != RTOS_CORE_1_IDX_OF_PID_TIMER
                  , "If safe-RTOS runs on different cores then they need to have different"
                    " clock sources"
                  );
    _Static_assert( RTOS_RUN_SAFE_RTOS_ON_CORE_0_Z4A == 0
                    ||  RTOS_RUN_SAFE_RTOS_ON_CORE_2_Z2 == 0
                    ||  RTOS_CORE_0_IDX_OF_PID_TIMER != RTOS_CORE_2_IDX_OF_PID_TIMER
                  , "If safe-RTOS runs on different cores then they need to have different"
                    " clock sources"
                  );
    _Static_assert( RTOS_RUN_SAFE_RTOS_ON_CORE_1_Z4B == 0
                    ||  RTOS_RUN_SAFE_RTOS_ON_CORE_2_Z2 == 0
                    ||  RTOS_CORE_1_IDX_OF_PID_TIMER != RTOS_CORE_2_IDX_OF_PID_TIMER
                  , "If safe-RTOS runs on different cores then they need to have different"
                    " clock sources"
                  );

    /* Note, time PIT0 must not be used. It is occupied by the DMA channel as trigger for
       serial output. */

    /* Disable timers during configuration. RM, 51.4.1, p. 2731. */
    PIT->MCR = PIT_MCR_MDIS(1) | PIT_MCR_FRZ(1);

    /* Install the interrupt handlers for cyclic timer PIT 1 and 2. The interrupts go to
       core 0, Z4A. */
       
    /* Install the interrupt service routine for the configured cyclic timer PITn
       (depending on calling core). The interrupt goes to the calling core. It drives the OS
       scheduler for cyclic task activation. */
    const unsigned int processorID = rtos_osGetIdxCore()
                     , idxTimerChn = rtos_idxRtosTimerAry[processorID]
                     , vectorNum = PIT_Ch0_IRQn + idxTimerChn;
    assert(vectorNum >= PIT_Ch1_IRQn  &&  vectorNum <= PIT_Ch15_IRQn);
    rtos_osRegisterInterruptHandler( &onOsTimerTick
                                   , processorID
                                   , vectorNum
                                   , RTOS_KERNEL_IRQ_PRIORITY
                                   , /* isPremptable */ true
                                   );

    /* Peripheral clock has been initialized to 40 MHz. To get a 1ms interrupt tick we
       need to count till 40000. We configure an interrupt rate of RTOS_CLOCK_TICK_IN_MS
       Milliseconds.
         -1: See RM, 51.6 */
/// @todo Here, we need to have a double-check with CCL
    PIT->TIMER[idxTimerChn].LDVAL = 40000u*RTOS_CLOCK_TICK_IN_MS -1;
/// @todo Have minimal variations for different core, ideally prime periods to improve testing

    /* Enable timer operation. Note, this doesn't release the scheduler yet; the step size
       is still zero and the system time doesn't advance despite of the starting timer
       interrupt.
         PIT_MCR_FRZ: For this multi-core MCU it is not so easy to decide whether or not to
       let the timers be stopped on debugger entry: Any stopped core will halt the timers,
       regardless whether that core is related to the timer or not (and how should the
       debugger know...). Both possibilities can be annoying or advantageous, depending on
       the situation. */
    PIT->MCR = PIT_MCR_MDIS(0) | PIT_MCR_FRZ(1);
    
