PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos_scheduler.c
    /* Clear possibly pending interrupt flags. */
    PIT->TIMER[idxTimerChn].TFLG = PIT_TFLG_TIF(1);
    
    /* Enable interrupts by the timers and start them. See RM 51.4.10. */
    PIT->TIMER[idxTimerChn].TCTRL = PIT_TCTRL_CHN(0) | PIT_TCTRL_TIE(1) | PIT_TCTRL_TEN(1);
    
} /* End of initRTOSClockTick */




/**
 * Creation of an event. The event can be cyclically triggering or software triggered.
 * An event is needed to activate a user task. Therefore, any reasonable application will
 * create at least one event.\n
 *   This function is repeatedly called by the application code for each required event.
 * All calls of this function need to be done prior to the start of the kernel using
 * rtos_osInitKernel().\n
 *   @return
 * \a rtos_err_noError (zero) if the event could be created. The maximum number of events
 * is limited to #RTOS_MAX_NO_EVENTS by hardware constraints. If the event cannot be
 * created due to this constraint or if the event descriptor contains invalid data then
 * then the function returns a non zero value from enumeration \a rtos_errorCode_t.\n
 *   An assertion in the calling code is considered appropriate to handle the error because
 * it'll always be a static configuration error.
 *   @param pEventId
 * All events are identified by a positive integer. Normally this ID is returned by
 * reference in * \a pEventId. If the event cannot be created then #RTOS_INVALID_EVENT_ID
 * is returned in * \a pEventId.\n
 *   Note, it is guaranteed to the caller that the returned ID is not an arbitrary,
 * meaningless number. Instead, the ID is counted from zero in order of creating events.
 * The first call of this function will return 0, the second 1, and so on. This simplifies
 * ID handling in the application code, constants can mostly be applied as the IDs are
 * effectively known at compile time.
 *   @param tiCycleInMs
 * The period time for regularly triggering events in ms.\n
 *   The permitted range is 0..2^30-1. 0 means no regular, timer controlled trigger and the
 * event is only enabled for software trigger using rtos_triggerEvent() (permitted for
 * interrupts or other tasks).
 *   @param tiFirstActivationInMs
 * The first trigger of the event in ms after start of kernel. The permitted range is
 * 0..2^30-1.\n
 *   Note, this setting is useless if a cycle time zero in \a tiCycleInMs specifies a non
 * regular event. \a tiFirstActivationInMs needs to be zero in this case, too.
 *   @param priority
 * The priority of the event in the range 1..UINT_MAX. Different events can share the same
 * priority. The priority of an event is the priority of all associated tasks at the same
 * time. The execution of tasks, which share the priority will be serialized when they are
 * activated at same time or with overlap.\n
 *   Note the safety constraint that task priorities above #RTOS_MAX_LOCKABLE_TASK_PRIORITY
 * are available only to events, which solely have tasks associated that belong to the
 * process with highest process ID in use.\n
 *   Note, the order in which events are created can affect the priority in a certain
 * sense. If two events are created with same priority and when they at runtime become due
 * at the same OS time tick then the earlier created event will trigger its associated user
 * tasks before the later ceated event.
 *   @param minPIDToTriggerThisEvent
 * An event can be triggered by user code, using rtos_triggerEvent(). However, tasks
 * belonging to less privileged processes must not generally have permission to trigger
 * events that may activate tasks of higher privileged processes. Since an event is not
 * process related, we make the minimum process ID, which is required to trigger this
 * event, an explicitly configured property of the event.\n
 *   Only tasks belonging to a process with PID >= \a minPIDToTriggerThisEvent are
 * permitted to trigger this event.\n
 *   The range of \a minPIDToTriggerThisEvent is 0 ... (#RTOS_NO_PROCESSES+1). 0 and 1 both
 * mean, all processes may trigger the event, (#RTOS_NO_PROCESSES+1) means only OS code can
 * trigger the event. (#RTOS_NO_PROCESSES+1) is available as
 * #RTOS_EVENT_NOT_USER_TRIGGERABLE, too.
 *   @param taskParam
 * The event is used to trigger its associated tasks. An argument can be passed to the task
 * functions, when they are called later. The initial value of this argument is set now.\n
 *   Actually, the relevance of this initial value is little. It'll be used mainly for
 * regular, time triggered tasks, but for these tasks, the task parameter will mostly (not
 * always) be meaningless and event tasks will receive a specific argument, which is
 * defined when triggering the event they are associated with. See rtos_triggerEvent() for
 * more details.
 *   @remark
 * Never call this function after the call of rtos_osInitKernel()!
 *   @remark
 * This function must be called by trusted code in supervisor mode only.
 */
rtos_errorCode_t rtos_osCreateEvent( unsigned int *pEventId
                                   , unsigned int tiCycleInMs
                                   , unsigned int tiFirstActivationInMs
                                   , unsigned int priority
                                   , unsigned int minPIDToTriggerThisEvent
                                   , uintptr_t taskParam
                                   )
{
    rtos_kernelInstanceData_t * const pIData = rtos_osGetInstancePtr();

    *pEventId = RTOS_INVALID_EVENT_ID;

    /* The number of events is constraint in order to let our mapping tables not grow more
       thatreasonable */
    if(pIData->noEvents >= RTOS_MAX_NO_EVENTS)
        return rtos_err_tooManyEventsCreated;

    if(priority == 0  ||  priority > RTOS_MAX_TASK_PRIORITY)
        return rtos_err_invalidEventPrio;

    /* Check settings for non regularly activated tasks. */
    if(tiCycleInMs == 0)
    {
        /* Avoid a useless and misleading setting. */
        if(tiFirstActivationInMs != 0)
            return rtos_err_badEventTiming;
    }

    /* The full 32 Bit range is avoided for time designations in order to have safe and
       unambiguous before and after decisions in a cyclic time model.
         Furthermore, no task must have the initial due time of 0xffffffff in order to not
       invalidate the startup logic of the scheduler (see rtos_osInitKernel()). */
    else if(((tiCycleInMs | tiFirstActivationInMs) & 0xc0000000) != 0)
        return rtos_err_badEventTiming;

