PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos_scheduler.c
    /* Is the PID constraint plausible? */
    _Static_assert( RTOS_NO_PROCESSES >= 0  &&  RTOS_NO_PROCESSES <= 254
                  , "Possible overflow of uint8_t pNewEvent->minPIDForTrigger"
                  );
    if(minPIDToTriggerThisEvent > RTOS_NO_PROCESSES+1)
        return rtos_err_eventNotTriggerable;

    /* Insert the new event into the array and initialize the data structure. The position
       to insert is such that the events appear in order of decreasing priority. */
    unsigned int idxNewEv, v;
    for(idxNewEv=0; idxNewEv<pIData->noEvents; ++idxNewEv)
    {
        if(getEventByIdx(idxNewEv)->priority < priority)
            break;
    }

    for(v=pIData->noEvents; v>idxNewEv; --v)
        *getEventByIdx(v) = *getEventByIdx(v-1);

    rtos_eventDesc_t *pNewEvent = getEventByIdx(idxNewEv);
    pNewEvent->tiCycleInMs = tiCycleInMs;
    pNewEvent->tiDue = tiFirstActivationInMs;
    pNewEvent->priority = priority;
    pNewEvent->minPIDForTrigger = minPIDToTriggerThisEvent;
    pNewEvent->noActivationLoss = 0;
    pNewEvent->taskAry = NULL;
    pNewEvent->noTasks = 0;
    pNewEvent->taskParam = taskParam;
    pNewEvent->pNextScheduledEvent = NULL;

    const unsigned int idNewEv = pIData->noEvents++;
    assert(pIData->noEvents > 0);

    /* Update the mapping of (already issued, publically known) event IDs onto the (now
       modified) internal arry index. */
    pIData->mapEventIDToPtr[idNewEv] = getEventByIdx(idxNewEv);
    for(v=0; v<idNewEv; ++v)
        if(pIData->mapEventIDToPtr[v] >= getEventByIdx(idxNewEv))
            ++ pIData->mapEventIDToPtr[v];

    /* Install the guard element at the end of the list. Essential is a priority value of
       zero, i.e. below any true, scheduled task. */
    /// @todo Effectively, this object can be considered the descriptor of the idle task.
    // At other location we wonder, whether we should offer idle tasks which are owned by
    // the different processes. It would be straightforward to use this object, and
    // particularly its field taskAry to implement this. Instead of returning from the
    // initKernel we would start a first scheduler instance. An ugly detail: Without
    // modification, the normal scheduling would clear the state "triggered" after
    // execution of all associated tasks. Is it worth to let the normal scheduling suffer
    // from an additional run-time condition just to make the idle concept work in the
    // sketched way?
    _Static_assert( RTOS_EVENT_NOT_USER_TRIGGERABLE <= UINT_T_MAX(pNewEvent->minPIDForTrigger)
                  , "Integer overflow"
                  );
    *getEventByIdx(pIData->noEvents) = 
                (rtos_eventDesc_t){ .tiCycleInMs = 0
                                    , .tiDue = 0
                                    , .priority = 0
                                    , .minPIDForTrigger = RTOS_EVENT_NOT_USER_TRIGGERABLE
                                    , .noActivationLoss = 0
                                    , .taskAry = NULL
                                    , .noTasks = 0
                                    , .taskParam = 0
                                    , .pNextScheduledEvent = NULL
                                  };
  
#ifdef DEBUG
    for(v=1; v<=pIData->noEvents; ++v)
        if(getEventByIdx(v)->priority > getEventByIdx(v-1)->priority)
            return rtos_err_invalidEventPrio; /* Actually an internal implementation error */
#endif
    /* Assign the next available array index as publically known event ID. */
    *pEventId = idNewEv;

    return rtos_err_noError;

} /* End of rtos_osCreateEvent */



/**
 * Registration of a process initialization task. This function is typically repeatedly
 * called by the operating system initialization code as often as there are processes,
 * which need initialization.\n
 *   Initialization functions are particularly useful for the user processes. They allow
 * having user provided code, that is run prior to the start of the scheduler, in a still
 * race condition free environment but already with full protection against runtime
 * failures.\n
 *   All calls of this function need to be done prior to the start of the kernel using
 * rtos_osInitKernel().
 *   @return
 * \a rtos_err_noError (zero) if the task could be registered. The maximum number of
 * initialization tasks is one per process and one for the OS. If the limit is exceeded or
 * if the task specification is invalid then the function returns a non zero value from
 * enumeration \a rtos_errorCode_t.\n
 *   An assertion in the calling code is considered appropriate to handle the error because
 * it'll always be a static configuration error.
 *   @param initTaskFct
 * The initialization function, which is run once in process \a PID.\n
 *   The function gets the ID of the process it belongs to as argument.\n
 *   The function returns a signed value. If the value is negative then it is considered an
 * error, which is counted as error #RTOS_ERR_PRC_USER_ABORT in the owning
 * process and the scheduler will not start up.
 *   @param PID
 *   The process the task belongs to by identifier. We have a fixed, limited number of four
 * processes (#RTOS_NO_PROCESSES) plus the kernel process, which has ID 0. The range of
 * process IDs to be used here is 0 .. #RTOS_NO_PROCESSES.\n
 *   At kernel initialization time, the registered user process initialization functions
 * will be called in the order of rising PID, followed by the registered kernel process
 * initialization function.
 *   @param tiTaskMaxInUs
 * Time budget for the function execution in Microseconds. The budget relates to
 * deadline monitoring, i.e. it is a world time budget, not an execution time budget.\n
 *   Deadline monitoring is supported up to a maximum execution time of
 * #RTOS_TI_DEADLINE_MAX_IN_US Microseconds.\n
 *   A value of zero means that deadline monitoring is disabled for the run of the
 * initialization function.\n
 *   There's no deadline monitoring for OS tasks. If \a PID is zero then \a
 * tiTaskMaxInUS meeds to be zero, too.
 *   @remark
 * Never call this function after the call of rtos_osInitKernel()!
 *   @remark
 * This function must be called by trusted code in supervisor mode only.
 */
rtos_errorCode_t rtos_osRegisterInitTask( int32_t (*initTaskFct)(uint32_t PID)
                                        , unsigned int PID
                                        , unsigned int tiTaskMaxInUs
                                        )
{
    return registerTask(EVENT_ID_INIT_TASK, (uintptr_t)initTaskFct, PID, tiTaskMaxInUs);

} /* End of rtos_osRegisterInitTask */




/**
 * Registration of an event triggered user mode task. Normal, event activated tasks can be
 * registered for later execution. This function is repeatedly called by the application
 * code as often as user mode tasks are required.\n
 *   All calls of this function need to be done prior to the start of the kernel using
 * rtos_osInitKernel().
 *   @return
 * \a rtos_err_noError (zero) if the task could be registered. The maximum number of
 * tasks is limited to #RTOS_MAX_NO_TASKS (regardless, how they are distributed among
 * processes). If the limit is exceeded or if the task specification is invalid then the
 * function returns a non zero value from enumeration \a rtos_errorCode_t.\n
 *   An assertion in the calling code is considered appropriate to handle the error because
 * it'll always be a static configuration error.
 *   @param idEvent
 * The task is activated by an event. This call associates the registered task with an
 * already created event. See rtos_osCreateEvent().\n
 *   The order of registration of several tasks (both, OS and user mode) with one and the
 * same event matters. The tasks will be acivated in order of registration whenever the
 * event becomes due or is triggered by software.
 *   @param userModeTaskFct
 * The task function, which is run in process \a PID every time, the event \a idEvent
 * triggers.\n
 *   The function gets the ID of the process it belongs to as argument.\n
 *   The function returns a signed value. If the value is negative then it is considered an
 * error, which is counted as error #RTOS_ERR_PRC_USER_ABORT in the owning
 * process. (And after a number of errors a supervisory task could force a shutdown of the
 * process).
 *   @param PID
 *   The process the task belongs to by identifier. We have a fixed, limited number of four
 * processes (#RTOS_NO_PROCESSES). The range of process IDs to be used here is 1 ..
 * #RTOS_NO_PROCESSES.\n
 *   @param tiTaskMaxInUs
 * Time budget for the task in Microseconds. This budget is granted for each activation of
 * the task, i.e. each run of \a userModeTaskFct(). The budget relates to deadline
 * monitoring, i.e. it is a world time budget, not an execution time budget.\n
 *   Deadline monitoring is supported up to a maximum execution time of
 * #RTOS_TI_DEADLINE_MAX_IN_US Microseconds.\n
 *   A value of zero means that deadline monitoring is disabled for the task.\n
 *   @remark
 * Never call this function after the call of rtos_osInitKernel()!
 *   @remark
 * This function must be called by trusted code in supervisor mode only.
 */
rtos_errorCode_t rtos_osRegisterUserTask( unsigned int idEvent
                                        , int32_t (*userModeTaskFct)( uint32_t PID
                                                                    , uintptr_t taskParam
                                                                    )
                                        , unsigned int PID
                                        , unsigned int tiTaskMaxInUs
                                        )
{
    /* OS task functions have another signature and should be registered with the other
       function rtos_osRegisterOSTask(). */
    if(PID == 0)
        return rtos_err_badProcessId;

