PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos_scheduler.c
    return registerTask(idEvent, (uintptr_t)userModeTaskFct, PID, tiTaskMaxInUs);

} /* End of rtos_osRegisterUserTask */



/**
 * Registration of an event triggered operating system task. Event activated tasks can be
 * registered for later execution. This function is repeatedly called by the application
 * code as often as operating system tasks are required.\n
 *   All calls of this function need to be done prior to the start of the kernel using
 * rtos_osInitKernel().
 *   @return
 * \a rtos_err_noError (zero) if the task could be registered. The maximum number of
 * tasks is limited to #RTOS_MAX_NO_TASKS (regardless, how they are distributed among
 * processes). If the limit is exceeded or if the task specification is invalid then the
 * function returns a non zero value from enumeration \a rtos_errorCode_t.\n
 *   An assertion in the calling code is considered appropriate to handle the error because
 * it'll always be a static configuration error.
 *   @param idEvent
 * The task is activated by an event. This call associates the registered task with an
 * already created event. See rtos_osCreateEvent().\n
 *   The order of registration of several tasks (both, OS and user mode) with one and the
 * same event matters. The tasks will be acivated in order of registration whenever the
 * event becomes due or is triggered by software.
 *   @param osTaskFct
 * The task function, which is run in the OS context every time, the event \a idEvent
 * triggers.
 *   @remark
 * Never call this function after the call of rtos_osInitKernel()!
 *   @remark
 * This function must be called by trusted code in supervisor mode only.
 */
rtos_errorCode_t rtos_osRegisterOSTask( unsigned int idEvent
                                      , void (*osTaskFct)(uintptr_t taskParam)
                                      )
{
    return registerTask(idEvent, (uintptr_t)osTaskFct, /* PID */ 0, /* tiTaskMaxInUs */ 0);

} /* End of rtos_osRegisterOSTask */



/**
 * Initialization and start of the RTOS kernel.\n
 *   The function initializes a hardware device to produce a regular clock tick and
 * connects the OS schedule function onOsTimerTick() with the interrupt raised by this
 * timer device. After return, the RTOS is running with a regular clock tick for scheduling
 * the tasks. Period time is #RTOS_CLOCK_TICK_IN_MS Milliseconds.\n
 *   The function can be called before or after the External Interrupts are enabled at the
 * CPU (see rtos_osResumeAllInterrupts()). Normal behavior is however, no to resume the
 * interrupt processing before and let this be done by rtos_osInitKernel().
 *   @return
 * \a rtos_err_noError (zero) if the scheduler could be started. The function returns a non
 * zero value from enumeration \a rtos_errorCode_t if a configuration error is detected.
 * The software must not start up in this case. Since it is only about static
 * configuration, the returned error may be appropriately handled by an assertion.
 *   @remark
 * The RTOS kernel applies the Periodic Interrupt Timer 0 (PIT0) as clock source. This
 * timer is reserved to the RTOS and must not be used at all by some other code.
 *   @remark
 * All application tasks need to be registered before invoking this function, see
 * rtos_osRegisterInitTask(), rtos_osRegisterUserTask() and rtos_osRegisterOSTask().
 *   @remark
 * This function must be called from the OS context only. The call of this function will
 * end the operating system initialization phase.
 */
rtos_errorCode_t rtos_osInitKernel(void)
{
    rtos_kernelInstanceData_t * const pIData = rtos_osGetInstancePtr();

    /* If this assertion fires then you
       - should double-check if you can redefine your task priorities such that they use
         consecutive numbers, 1, 2, 3 ...
       - can decide to change the condition of the assertion if you really need so many
         different task priorities
       - should decide if you change the implementation of the mapping from task priority
         to event having that priority. So far we chose the most time efficient technique,
         a direct lookup table, but any other technique would be fine, too. */
    _Static_assert( RTOS_MAX_TASK_PRIORITY <= 64
                  , "The used range of task priorities has been chosen such large that the"
                    " implementation becomes quite inefficient in terms of memory usage"
                  );
                  
    /* The C code has an interface with the assembler code. It is used to exchange process
       and task related information. The interface is modeled twice, once as structs for C
       code and once as set of preprocessor macros, which hold size of data structures and
       offsets of fields. Here, we have macros, which support double-checking the
       equivalence of both definitions. The compiler will abort the compilation if there is
       a static inconsistency. A few more conditions require run-time checking. */
    assert(RTOS_CONSTRAINTS_INTERFACE_C_AS_PCP);
    _Static_assert( RTOS_STATIC_CONSTRAINTS_INTERFACE_C_AS_PCP
                  , "Interface check C to assembly failed for module"
                    " rtos_priorityCeilingProtocol.S"
                  );

    /* Initialization of system all module: For now it's just used to place some unit
       self-test code. */
    rtos_osInitSystemCalls();

    rtos_errorCode_t errCode = rtos_err_noError;

    /* The pointer pIData->pNextEventToSchedule is either unset or it points to the event of
       highest priority which has been triggered but which cannot be scheduled yet because
       we are still in an ISR. The value "unset" need to maintain the ordering of pointers,
       the higher the value the lesser the priority of an event it points to. NULL would
       not fulfill both condition and therefore require additional runtime code. We choose
       UINT_MAX as indication of "unset". */
    pIData->pNextEventToSchedule = (rtos_eventDesc_t*)(uintptr_t)-1;

    pIData->pEndEvent     =
    pIData->pCurrentEvent = getEventByIdx(pIData->noEvents);
    pIData->currentPrio = 0;

    /* The user must have registered at minimum one task and must have associated it with a
       event. */
    if(pIData->tiOsStep != 0)
        errCode = rtos_err_configurationOfRunningKernel;
    else if(pIData->noEvents == 0  ||  pIData->noTasks == 0)
        errCode = rtos_err_noEvOrTaskRegistered;

