PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos_scheduler.c
    /* Fill all process stacks with the empty-pattern, which is applied for computing the
       stack usage. */
    bool isProcessConfiguredAry[1+RTOS_NO_PROCESSES] = {[0 ... RTOS_NO_PROCESSES] = false};
    if(errCode == rtos_err_noError)
        errCode = rtos_osInitProcesses(isProcessConfiguredAry);

    unsigned int idxTask
               , maxPIDInUse = 0;
    /* Find the highest PID in use. */
    for(idxTask=0; idxTask<pIData->noTasks; ++idxTask)
        if(pIData->taskCfgAry[idxTask].PID > maxPIDInUse)
            maxPIDInUse = pIData->taskCfgAry[idxTask].PID;

    /* A task must not belong to an invalid configured process. This holds for init and for
       run time tasks. */
    if(errCode == rtos_err_noError)
    {
        unsigned int idxP;
        for(idxTask=0; idxTask<pIData->noTasks; ++idxTask)
        {
            assert(pIData->taskCfgAry[idxTask].PID < sizeOfAry(isProcessConfiguredAry));
            if(!isProcessConfiguredAry[pIData->taskCfgAry[idxTask].PID])
                errCode = rtos_err_taskBelongsToInvalidPrc;

        } /* For(All registered runtime tasks) */

        for(idxP=0; idxP<1+RTOS_NO_PROCESSES; ++idxP)
        {
            /* Note, the init task array is - different to the runtime task array
               pIData->taskCfgAry - ordered by PID. The field PID in the array entries are
               redundant. A runtime check is not appropriate as this had happened at
               registration time. We can place a simple assertion here. */
            if(pIData->initTaskCfgAry[idxP].addrTaskFct != 0)
            {
                assert(pIData->initTaskCfgAry[idxP].PID == idxP);
                if(!isProcessConfiguredAry[idxP])
                    errCode = rtos_err_taskBelongsToInvalidPrc;
            }
        } /* for(All possibly used processes) */
    }

    /* Now knowing, which is the process with highest privileges we can double-check the
       permissions granted for using the service rtos_runTask(). It must not be possible to
       run a task in the process with highest privileges. */
    if(errCode == rtos_err_noError)
    {
        unsigned int callingPID;
        for(callingPID=1; callingPID<=maxPIDInUse; ++callingPID)
            if(rtos_osCheckPermissionRunTask(callingPID, /* targetPID */ maxPIDInUse))
                errCode = rtos_err_runTaskBadPermission;
    }

    /* We could check if a process, an init task is registered for, has a least one runtime
       task. However, it is not harmful if not and there might be pathologic applications,
       which solely consist of I/O driver callbacks. */

    if(errCode == rtos_err_noError)
    {
        unsigned int idxEv;
        for(idxEv=0; idxEv<pIData->noEvents; ++idxEv)
        {
            const rtos_eventDesc_t * const pEvent = getEventByIdx(idxEv);
            const unsigned int noAssociatedTasks = (unsigned int)pEvent->noTasks;

            /* Check task configuration: Events without an associated task are useless and
               point to a configuration error. */
            if(noAssociatedTasks == 0)
                errCode = rtos_err_eventWithoutTask;

            /* If an event has a priority above #RTOS_MAX_LOCKABLE_TASK_PRIORITY then only
               those tasks can be associated, which belong to the process with highest PID
               in use or OS tasks. This is a safety constraint. */
            if(pEvent->priority > RTOS_MAX_LOCKABLE_TASK_PRIORITY)
            {
                for(idxTask=0; idxTask<noAssociatedTasks; ++idxTask)
                {
                    const unsigned int PID = pEvent->taskAry[idxTask].PID;
                    if(PID > 0  &&  PID != maxPIDInUse)
                        errCode = rtos_err_highPrioTaskInLowPrivPrc;
                }
            } /* End if(Unblockable priority is in use by event) */
        } /* for(All registered events) */
    }

    /* The scheduling of events of potentially same priority is supported by a link
       pointer, which points the scheduler to the next event to check after the event had
       been processed. This next event is either the first one in a group of events of same
       priority or the linear successor if this would be the event itself. */
    if(errCode == rtos_err_noError)
    {
        unsigned int idxEv, idxEvNextPrio;
        unsigned int lastPrio = sizeOfAry(pIData->mapPrioToEvent);
        for(idxEv=0; idxEv<=pIData->noEvents; ++idxEv)
        {
            rtos_eventDesc_t * const pEvent = getEventByIdx(idxEv);

            /* Is this event the first one of the group of next lower priority? */
            if(idxEv == 0  ||  pEvent->priority < lastPrio)
            {
                const uint32_t priority = pEvent->priority;
                idxEvNextPrio = idxEv;
                
                /* The first event in such a group is linked to the next one in order of
                   the list. */
                if(idxEv < pIData->noEvents)
                {
                    pEvent->pNextScheduledEvent = getEventByIdx(idxEv+1);
                    assert(priority > 0);
                }
                else
                {
                    pEvent->pNextScheduledEvent = NULL;
                    assert(priority == 0);
                }
                    
                /* Add an entry to the map from priority to event. Assertions are fine to
                   make the code safe - the according object properties have already been
                   validated when creating the event objects. */
                unsigned int idxMapEntry = lastPrio-1;
                do
                {
                    assert(idxMapEntry < sizeOfAry(pIData->mapPrioToEvent));
                    pIData->mapPrioToEvent[idxMapEntry] = pEvent;
                }
                while(idxMapEntry-- > priority);

                lastPrio = priority;
            }
            else
            {
                /* All further events in such a group are linked to the first event of the
                   group. */
                pEvent->pNextScheduledEvent = getEventByIdx(idxEvNextPrio);
            }
        } /* End for(All events) */
    } /* End if(No initialization error yet) */

