PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos_scheduler.c
    /* After checking the static configuration, we can enable the dynamic processes.
       Outline:
       - Disable all processes (which is their initial state). Once we enable the
         interrupts, the I/O drivers start working and they may invoke callbacks into the
         processes. The execution of these callbacks will be inhibited
       - Initialize the memory protection. This needs to be done before the very first user
         mode task function has the chance to become started. (The very first user mode task
         functions need to be the process initialization tasks.)
       - Disable the scheduler to trigger any events (which is its initial state).
         Triggering events would not cause any user tasks to execute (processes still
         disabled) but their due counters would already run and the configured startup
         conditions would not be met later when enabling the processes
       - Globally enable interrupt processing. I/O drivers and OS clock tick are running.
         This is a prerequisite for the deadline monitoring, which we want to have in place
         already for the init tasks
       - Sequentially execute all configured process initialization tasks. There are no
         crosswise race condition and nor with user tasks or I/O driver callbacks. Note,
         interrupts are already running and cause race conditions. Moreover, they could
         make use of rtos_osTriggerEvent() and if an OS task is associated with the
         triggered event then there would be race conditions with this OS task, too
       - Enable the processes and release the scheduler; scheduler, user tasks and I/O
         driver's callbacks start running */

    /* Arm the memory protection unit. The processes are shared between the cores and, as a
       consequence, one static MPU configuration is used to control the behavior of all
       three cores. The MPU initialization is called only for core 0. */
    if(errCode == rtos_err_noError  &&  rtos_osGetIdxCore() == RTOS_CORE_Z4A)
        rtos_osInitMPU();

    /* Stop the scheduler. It won't run although the RTOS clock starts spinning. We don't
       want to see a running user task during execution of the init tasks. */
    pIData->tiOs     = (unsigned long)-1;
    pIData->tiOsStep = 0;

    /* We can register the interrupt service routine for the scheduler timer tick. */
    if(errCode == rtos_err_noError)
        initRTOSClockTick();

    /* All processes are initialized by rtos_initProcesses() in stopped state: We don't want
       to see a callback from an I/O driver after resuming interrupt processing and while
       an init task is executed. Note, it doesn't really matter if interrupt processing was
       resumed already before. */
    if(errCode == rtos_err_noError)
        rtos_osResumeAllInterrupts();

    /* When we get here (and if we didn't see a configuration error) then all kernel
       interrupts are configured, interrupts occur and are processed, but no user tasks are
       activated nor will an I/O driver run a callback. We can safely start our process
       initialization tasks. */

    /* Run all process initialization in order of increasing PID. A process with higher
       privileges is initialized after another with less privileges. The higher privileged
       could override settings made by its predecessor.
         In this consideration and despite of its PID zero, the operating system process
       has the highest privileges. This requires a loop counter like 1, 2, ..., N, 0. */
    if(errCode == rtos_err_noError)
    {
        unsigned int idxP = 0;
        do
        {
#if RTOS_NO_PROCESSES > 0
            if(idxP < RTOS_NO_PROCESSES)
                ++ idxP;
            else
                idxP = 0;
#else
            /* No processes, just initialize the OS. idxP=0 is only loop cycle. */
#endif

            /* The specification of an initialization task is an option only. Check for
               NULL pointer. */
            if(pIData->initTaskCfgAry[idxP].addrTaskFct != 0)
            {
                if(isProcessConfiguredAry[idxP])
                {
                    /* Everything is alright. Run the initialization task. A negative
                       return value is defined to be an error. (This needs to be considered
                       by the implementation of the task.) */
                    int32_t resultInit;
                    if(pIData->initTaskCfgAry[idxP].PID == 0)
                    {
                        /* OS initialization function: It is a normal sub-function call; we
                           are here in the OS context. */
                        resultInit =
                            ((int32_t (*)(void))pIData->initTaskCfgAry[idxP].addrTaskFct)();
                    }
                    else
                    {
                        /* The initialization function of a process is run as a task in
                           that process, which involves full exception handling and
                           possible abort causes. */
                        resultInit = rtos_osRunInitTask(&pIData->initTaskCfgAry[idxP]);
                    }
                    if(resultInit < 0)
                        errCode = rtos_err_initTaskFailed;
                }
                else
                {
                    /* An initialization task must not be registered for a process, which
                       is not configured. This had been checked above and we can never get
                       here. */
                    assert(false);
                }
            } /* End if(Init task configured for process?) */
        }
        while(idxP != 0);  /* End for(All possible processes, OS as last one) */
        
    } /* End if(No error so far?) */
    
    /* After successfully completing all the initialization tasks, we can release the
       scheduler and the processes. We do this in a critical section in order to not
       endanger the specified relationship of initial task activations (specified in terms
       of task priority, period time and initial due time). */
    if(errCode == rtos_err_noError)
    {
        rtos_osSuspendAllInterrupts();

