PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos_scheduler.c
        /* Process state: Set to running (not zero) only if configuration generally okay. */
        unsigned int idxP;
        for(idxP=1; idxP<1+RTOS_NO_PROCESSES; ++idxP)
            if(isProcessConfiguredAry[idxP])
                rtos_osReleaseProcess(/* PID */ idxP);

        /* Release scheduler. */
        pIData->tiOsStep = RTOS_CLOCK_TICK_IN_MS;

        rtos_osResumeAllInterrupts();
    }

    /* @todo Shall we offer idle tasks per process? If so, we cannot leave the routine but
       would need to enter an infinite loop - and had to offer such a function for OS, too.
       For consistency reasons this would require an init function for OS, too. */

    return errCode;

} /* End of rtos_osInitKernel */




/**
 * Trigger an event to activate all associated tasks. A event, which had been registered
 * with cycle time zero is normally not executed. It needs to be triggered with this
 * function in order to make its associated tasks run once, i.e. to make its task functions
 * executed once as result of this call.\n
 *   This function can be called from any OS task or ISR. However, if the calling task
 * belongs to the set of tasks associated with \a idEvent, then it'll have no effect but an
 * accounted activation loss; an event can be re-triggered only after all associated
 * activations have been completed. There is no activation queueing. The function returns
 * \a false in this case.\n
 *   Note, the system respects the priorities of the activated tasks. If a task of priority
 * higher than the activating task is activated by the triggered event then the activating
 * task is immediately preempted to the advantage of the activated task. Otherwise the
 * activated task is chained and executed after the activating task.
 *   @return
 * There is no activation queuing. Consequently, triggering the event can fail if at least
 * one of the associated tasks has not yet completed after the previous trigger of the
 * event. The function returns \a false and the activation loss counter of the event is
 * incremented. (See rtos_getNoActivationLoss().) In this situation, the new trigger is
 * entirely lost, i.e. none of the associated tasks will be activated by the new trigger.
 *   @param idEvent
 * The ID of the event to activate as it had been got by the creation call for that event.
 * (See rtos_osCreateEvent().)
 *   @param taskParam
 * All associated tasks will receive this value, when they are called because of this
 * trigger.\n
 *   The value is ignored if the function returns \a false.
 *   @remark
 * The function is indented to start a non cyclic task by application software trigger but
 * can be applied to cyclic tasks, too. In which case the task function of the cyclic task
 * would be invoked once additionally. Note, that an event activation loss is not unlikely in
 * this case; the cyclic task may currently be busy.
 *   @remark
 * It may look like an inconsistent API design if all associated tasks receive the same
 * value \a taskParam from the triggering event. The service could easily offer an API,
 * which provides an individual value to each associated task. The only reason not to do
 * so is the additional overhead in combination with the very few imaginable use cases.
 * In most cases an explicitly triggered event will have just one associated task; events
 * with more than one task will mostly be regular timer tasks, which make rarely use of the
 * task parameter.
 *   @remark
 * If \a idEvent addresses a regular, time triggered event and if triggering succeeds, then
 * the regular tasks will receive the passed value from now on. (Instead of the initial
 * value specified at event creation time, see rtos_osCreateEvent().) Note, there's likely
 * no use case for this, it's just a side effect of the implementation. However, it should
 * not do any harm, because mostly regular tasks don't make use of the task parameter and
 * mostly this service is not permitted for such events. If it could be harmful, e.g. if a
 * timer event exceptionally makes use of the task parameter, then explicit triggering of
 * the event using this service needs to be inhibitted.
 *   @remark
 * It is not forbidden but useless to let a task activate itself by triggering the event it
 * is associated with. This will have no effect besides incrementing the activation loss
 * counter for that event.
 *   @remark
 * This function must be called from the OS context only. It may be called from an ISR to
 * implement delegation to a user task.
 */
bool rtos_osTriggerEvent(unsigned int idEvent, uintptr_t taskParam)
{
    /* This function behaves differently depending on whether it is called from an ISR
       (task activation is deferred) or from an OS task (task activation immediately
       possible depending on priorities). If we don't want to offer different APIs for
       tasks and ISRs then we need to have run-time code to decide. This is a little
       performance degradation for sake of ease of use and transparency of the API. */
    const bool isInterrupt = rtos_osIsInterrupt();
    
    /* Although it is not generally forbidden to call this function from a task while under
       lock of External Interrupt processing it's at least very suspicious; the function
       will unconditionally remove the lock, which is likely not what a calling context
       expects if it set the lock. We catch this situation by assertion.
         If this assertion fires then there's likely a misunderstanding of the semantics of
       rtos_osTriggerEvent() in the calling code. */
    assert(isInterrupt || !rtos_osGetAllInterruptsSuspended());
    
    /* This function is shared between ISRs and OS tasks. We need to know because the
       behavior depends (2nd function argument). */
    return osTriggerEvent( getEventByID(idEvent)
                         , /* hasTaskParam */ true
                         , taskParam
                         , isInterrupt
                         );
} /* End of rtos_osTriggerEvent */



/**
 * System call handler implementation to trigger an event (and to activate the associated
 * tasks). Find all details in rtos_osTriggerEvent().
 *   @return
 * \a true if activation was possible, \a false otherwise.
 *   @param pidOfCallingTask
 * Process ID of calling user task. The operation is permitted only for tasks belonging to
 * those processes, which
 * have an ID that is greater of equal to the minimum specified for the event in question.
 * Otherwise an exception is raised, which aborts the calling task.
 *   @param idEvent
 * The ID of the event to trigger. This is the ID got from rtos_osCreateEvent().
 *   @param taskParam
 * All associated tasks will receive this value, when they are called because of this
 * trigger.\n
 *   The value is ignored if the function returns \a false.
 *   @remark
 * It may look like an inconsistent API design if all associated tasks receive the same
 * value \a taskParam from the triggering event. The service could easily offer an API,
 * which provides an individual value to each associated task. The only reason not to do
 * so is the additional overhead in combination with the very few imaginable use cases.
 * In most cases an explicitly triggered event will have just one associated task; events
 * with more than one task will mostly be regular timer tasks, which make rarely use of the
 * task parameter.
 *   @remark
 * If \a idEvent addresses a regular, time triggered event and if triggering succeeds, then
 * the regular tasks will receive the passed value from now on. (Instead of the initial
 * value specified at event creation time, see rtos_osCreateEvent().) Note, there's likely
 * no use case for this, it's just a side effect of the implementation. However, it should
 * not do any harm, because mostly regular tasks don't make use of the task parameter and
 * mostly this service is not permitted for such events. If it could be harmful, e.g. if a
 * timer event exceptionally makes use of the task parameter, then explicit triggering of
 * the event using service rtos_triggerEvent() needs to be inhibitted.
 *   @remark
 * This function must never be called directly. The function is only made for placing it in
 * the global system call table.
 */
uint32_t rtos_scFlHdlr_triggerEvent( unsigned int pidOfCallingTask
                                   , unsigned int idEvent
                                   , uintptr_t taskParam
                                   )
{
    const rtos_kernelInstanceData_t * const pIData = rtos_osGetInstancePtr();
    if(idEvent < pIData->noEvents)
    {
        rtos_eventDesc_t * const pEvent = getEventByID(idEvent);
        if(pidOfCallingTask >= (unsigned int)pEvent->minPIDForTrigger)
            return (uint32_t)osTriggerEvent( pEvent
                                           , /* hasTaskParam */ true
                                           , taskParam
                                           , /* isInterrupt */ false
                                           );
    }

    /* The user specified event ID is not in range or the calling process doesn't have the
       required privileges. Either is a severe user code error, which is handled with an
       exception, task abort and counted error.
         Note, this function does not return. */
    rtos_osSystemCallBadArgument();

} /* End of rtos_scFlHdlr_triggerEvent */



/**
 * This function implements the main part of the scheduler, which actually runs tasks. It
 * inspects all events, whether they have been triggered in an ISR or system call handler
 * and execute the associated tasks if furthermore the priority conditions are fullfilled.
 *   The function is called from the common part of the assembly implementation of the ISRs
 * and from all system call handlers, which could potentially lead to the start of tasks.\n
 *   This function is entered with all interrupt processing disabled (MSR[ee]=0).
 *   @param
 * The caller (likely osTriggerEvent(), immediately or postponed) usually knows, which is
 * the recently triggered event, which has to be handled by the scheduler. This event is
 * provided by reference as a hint so that the scheduler doesn't need to look for the
 * event.
 */
SECTION(.text.ivor.rtos_osProcessTriggeredEvents) void rtos_osProcessTriggeredEvents
                                                               (rtos_eventDesc_t *pEvent)
{
    /* This function and particularly this loop is the essence of the task scheduler. There
       are some tricky details to be understood.
         This function is called as a kind of "on-exit-hook" of any interrupt, which makes
       use of the rtos_osTriggerEvent() service. (Actually, this includes user tasks, which
       run the software interrupt rtos_triggerEvent().) It looks for the triggered event
       and runs the associated tasks if it has a priority higher then the priority of the
       currently running task.
         The operation looks uncomplicated for an event of higher priority. We acknowledge
       the event and run the tasks. Looking for and acknowleding means a read-modify-write
       operation and since the events can at any time be accessed by interrupts of higher
       priority we need a critical section for this.
         First complexity is an interrupt, which sets another event while we are processing
       the tasks of the first one. If this has in turn a higher priority then it's no new
       consideration but just a matter of recursive invocation of this same function.
       However, if it has a priority lower than that of the currently processed event and
       tasks, then we (and not the preempting context, which triggers the event) are
       obliged to run the tasks of this event, too, but - because of the lower priority -
       only later, after the current set of tasks. (Note, "later", there is no
       HW/SW-interrupt any more to get the new event be processed - so we need a loop here
       to not forget that event.) The tricky thing is how to span the critical sections:
         If we find the first event (searching from highest towards lower priorities) then
       we apply the CS just to acknowledge the event. (I.e. no potential later, recursive
       invocation of this function will compete in handling it.) When done with all the
       tasks of the event we release the event. We change the status from "in progress" to
       "idle" - of course again in a CS. However, this CS must now be merged with the CS at
       the beginning of the next cycle, the CS to acknowledge the next found event. The
       reason why:
         As soon as we release an event, it can be set again and in particular before we
       have left this function and killed its stack frame (a stack frame of significant
       size as this function still is element of an ISR). The newly set event would mean a
       recursive call of this function, so another stack frame for the same event. The same
       could then happen to the recursice function invocation and so forth - effectively
       there were no bounds anymore for the stack consumption, which is a fatal risk.
       Merging the CSs for releasing event A and acknowledging event B (of lower priority)
       means that the stack frame of this invokation is inherited by the next processed
       event B before a recursive call can process the next occurance of A. Which is
       alright; this leads to the pattern that there can be outermost one stack frame per
       event priority and this is the possible minimum.
         The same consideration requires that the CS for the final event release must not
       be left before return from the function. Return from the function still means
       several instructions until the stack frame is killed and event setting in this phase
       is just the same as outlined for the loop cycle-to-cycle situation. Actually, the
       final CS must not be ended before the stack frame has been killed, effectively at
       the very end of the ISR, with the rfi instruction.
         Another consideration makes it useful that we are already inside the first
       acknowledge-CS when entering the function. This CS includes the decision (in
       triggerEvenet), whether or not a recursive scheduler call is required. Being here,
       and because of the CS, this information is still coherent with the events' state. We
       can place some assertions, the behavior is more transparent and the implementation
       more reliable. Without an CS we could see this: Event A is set and makes this
       scheduler invoked. Event B can be triggered before tbhe scheduler finds the due
       event. It is preempted by a recursive scheduler invocation. The preempting scheduler
       would handle both events, B first then A. After the preemption the event A is no
       longer due and the scheduler would have to return without doing anything. Which is
       neither a problem nor an advantage (same overall effort and timing), but there are
       less invariants for checking. Note, this is still an option if minimizing the CS
       is rated higher than transparency of behavior. */

    rtos_kernelInstanceData_t * const pIData = rtos_osGetInstancePtr();

