PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos_scheduler.c
    /* Here, we are inside a critical section. External Interrupt handling is disabled. */
    assert(rtos_osGetAllInterruptsSuspended());

    /* If we were called because of pending, postponed events, which are indicated by
       pIData->pNextEventToSchedule then the caller must have acknowledged the request by
       setting the pointer back to "unset". */
    assert((uintptr_t)pIData->pNextEventToSchedule == (uintptr_t)-1);

    /* Safe the current state: It'll be updated with each of the events, we find to be
       served, but finally we will have to restore these values here. */
    const rtos_eventDesc_t * const pCurrentEvent = pIData->pCurrentEvent;
    const unsigned int prioAtEntry = pIData->currentPrio;

    /* We iterate the events in order of decreasing priority. */
    assert(pEvent < pIData->pEndEvent &&  pEvent->priority >= prioAtEntry);
    while(true)
    {
        if(pEvent->priority <= prioAtEntry)
        {
            /* Launching tasks must not be considered for events at or below the priority
               at start of this scheduler recursion. This priority level will mostly be
               because another, earlier call of this function, preempted and currently
               suspended somewhere deeper on the OS stack, which already handles the event
               but it can also happen if the PCP has been used to temporarily raise the
               current priority. This would hinder us to serve a triggered event already
               now.
                 We leave the function still (or again) being in a critical section. */
            break;
        }
        else if(pEvent->state == evState_triggered)
        {
            /* Associated tasks are due and they have a priority higher than all other
               currently activated ones. Before we execute them we need to acknowledge the
               event - only then we my leave the critical section. */
            pEvent->state = evState_inProgress;

            /* The current priority is changed synchronously with the acknowledge of the
               event. We need to do this still inside the same critical section. */
            pIData->pCurrentEvent = pEvent;
            pIData->currentPrio = pEvent->priority;

            /* Now handle the event, i.e. launch and execute all associated tasks. This is
               of course not done inside the critical section. We leave it now. */
            rtos_osResumeAllInterrupts();
            launchAllTasksOfEvent(pEvent);

            /* The executed tasks can have temporarily changed the current priority, but
               here it needs to be the event's priority again.
                 The assertion can fire if an OS task raised the priority using the PCP API
               but didn't restore it again. */
            assert(pIData->currentPrio == pEvent->priority);

            /* The event is entirely processed, we can release it. This must not be done
               before we are again in the next critical section. */
            rtos_osSuspendAllInterrupts();
            pEvent->state = evState_idle;

            /* The next event to check is not necessarily the next in order. Since we allow
               events to have the same priority we need to ensure that we have checked all
               other events of same priority before we advance to one of lower priority.
               (If we wouldn't allow same priorities then this condition was implicitly
               fulfilled and we could always advance with the next event in order, which is
               surely of lower priority.)
                 Note, this consideration leads to the repeated check of the same events.
               Example: A and B were events of same priority and appear in the list in this
               order. Event A can be triggered while event B is being proceessed. We must
               check A before we check the successor of B, e.g. C, which has lower
               priority. While running the tasks of A, event B can have been triggered
               again, and so on. In an extreme situation, we would infinitly loop and
               alternatingly process A and B, but C would never been visited and suffer
               from starvation. (Easy to get: A task of A triggers event B and a task of B
               triggers event A.)
                 After we have served an event of priority n, we check the first event of
               this priority n as next one. All event specifications, inlcuding priorities,
               are staical and we have prepared a link from each event to the first in list
               order, which has the same priority but which is not the event itself.
               Examples:
               - A, B, C have prio n, D is the successor of C with prio n-1:
                 - A is linked to B
                 - B and C are linked to A
                 - D is linked to its successor
               - A has prio n, B has prio n-1, C has prio n-2:
                 - A is linked to B
                 - B is linked to C
                 - C is linked to its successor
                 Note, this scheme doesn't lead to a fair round robin for groups of events
               with same priority but this is not a contradiction with the meaning of
               priorities or priority based scheduling. */

            /* Proceed with preceding events of same priority (if any). */
            pEvent = pEvent->pNextScheduledEvent;
        }
        else
        {
            /* Ignore events, which have not been set (yet). */

            /* There must be no events in state inProgress, which have a priority above the
               current one. */
            assert(pEvent->state == evState_idle);

            /* Proceed with next event. No need to start over at first event of same
               priority as we had not left the critical section so that no such event can
               have been triggered meanwhile. */
            ++ pEvent;

        } /* End if(Which event state?) */
    } /* End while(All events of prio, which is to be handled by this scheduler invocation) */

