PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos_scheduler.c
    /* Here we are surely still or again inside a critical section. */

    /* Restored the initial state. */
    pIData->pCurrentEvent = pCurrentEvent;
    pIData->currentPrio = prioAtEntry;

} /* End of rtos_osProcessTriggeredEvents */



/**
 * Priority ceiling protocol (PCP), partial scheduler lock: All tasks up to the specified
 * task priority level won't be handled by the CPU any more. This function is intended for
 * implementing mutual exclusion of sub-sets of tasks.\n
 *   Note, the use of the other function pairs\n
 *   - rtos_osEnterCriticalSection() and\n
 *   - rtos_osLeaveCriticalSection()\n
 * or\n
 *   - rtos_osSuspendAllInterrupts() and\n
 *   - rtos_osResumeAllInterrupts()\n
 * locks all interrupt processing and no other task (or interrupt handler) can become
 * active while the task is inside the critical section code. With respect to behavior,
 * using the PCP API is much better: Call this function with the highest priority of all
 * tasks, which should be locked, i.e. which compete for the resource or critical section
 * to protect. This may still lock other, non competing tasks, but at least all interrupts
 * and all non competing tasks of higher priority will be served.\n
 *   The major drawback of using the PCP instead of the interrupt lock API is the
 * significantly higher expense; particularly at the end of the critical section, when
 * resuming the scheduling again: A recursive call of the scheduler is required to see if
 * some tasks of higher priority had become ready during the lock time. Therefore, locking
 * the interrupts is likely the better choice for very short critical sections.\n
 *   To release the protected resource or to leave the critical section, call the
 * counterpart function rtos_osResumeAllTasksByPriority(), which restores the original
 * task priority level.
 *   @return
 * The task priority level at entry into this function (and into the critical section) is
 * returned. This level needs to be restored on exit from the critical section using
 * rtos_osResumeAllTasksByPriority().
 *   @param suspendUpToThisTaskPriority
 * All tasks up to and including this priority will be locked, i.e. they won't be executed
 * even if they'd become ready. The CPU will not handle them until the priority level is
 * lowered again.
 *   @remark
 * The critical section shaped with this API from an OS task guarantees mutual exclusion
 * with critical section code shaped with the other API rtos_suspendAllTasksByPriority()
 * from a user code task.
 *   @remark
 * To support the use case of nested calls of OSEK/VDX like GetResource/ReleaseResource
 * functions, this function compares the stated value to the current priority level. If \a
 * suspendUpToThisTaskPriority is less than the current value then the current value is not
 * altered. The function still returns the current value and the calling code doesn't need
 * to take care: It can unconditionally end a critical section with
 * rtos_osResumeAllTasksByPriority() stating the returned priority level value. (The
 * resume function will have no effect in this case.) This makes the OSEK like functions
 * usable without deep inside or full transparency of the priority levels behind the scene;
 * just use the pairs of Get-/ResumeResource, be they nested or not.
 *   @remark
 * The use of this function to implement critical sections is usually quite static. For any
 * protected entity (usually a data object or I/O device) the set of competing tasks
 * normally is a compile time known. The priority level to set for entry into the critical
 * section is the maximum of the priorities of all tasks in the set. The priority level to
 * restore on exit from the critical section is the priority of the calling task. All of
 * this static knowledge would typically be put into encapsulating macros that actually
 * invoke this function. (OSEK/VDX like environments would use this function pair to
 * implement the GetResource/ReleaseResource concept.)
 *   @remark
 * Any change of the current priority level made with this function needs to be undone
 * using rtos_osResumeAllTasksByPriority() and still inside the same task. It is not
 * possible to consider this function a mutex, which can be acquired in one task activation
 * and which can be released in an arbitrary later task activation or from another task.\n
 *   Moreover, different to the user mode variant of the PCP function pair, there is no
 * restoration of the current priority level at task termination time.\n
 *   An assertion in the scheduler will likely fire if the two PCP APIs are not properly
 * used in pairs.
 *   @remark
 * This function must be called from OS tasks only. Any attempt to use it from either an
 * ISR or in user mode code will lead to either a failure or privileged exception,
 * respectively.
 *   @remark
 * This function requires that msr[EE]=1 on entry.
 */
uint32_t rtos_osSuspendAllTasksByPriority(uint32_t suspendUpToThisTaskPriority)
{
    rtos_kernelInstanceData_t * const pIData = rtos_osGetInstancePtr();
    const uint32_t prioBeforeChange = pIData->currentPrio;
    if(suspendUpToThisTaskPriority > prioBeforeChange)
        pIData->currentPrio = suspendUpToThisTaskPriority;

    return prioBeforeChange;

} /* rtos_osSuspendAllTasksByPriority */




/**
 * This function is called to end a critical section of code, which requires mutual
 * exclusion of two or more tasks. It is the counterpart of function
 * rtos_osSuspendAllInterruptsByPriority(), refer to that function for more details.\n
 *   @param resumeDownToThisTaskPriority
 * All tasks/interrupts above this priority level are resumed again. All tasks/interrupts
 * up to and including this priority remain locked.\n
 *   You will normally pass in the value got from the related call of
 * rtos_osSuspendAllInterruptsByPriority().
 *   @remark
 * Caution, this function lowers the current task priority level to the stated value
 * regardless of the initial value for the task. Accidentally lowering the task priority
 * level below the configured task priority (i.e. the priority inherited from the triggering
 * event) will have unpredictable consequences.
 *   @remark
 * Different to the user mode variant of the function, rtos_resumeAllTasksByPriority(),
 * there is no restoration of the current priority level at task termination time. For OS
 * tasks, there's no option to omit the resume operation if a critical section should last
 * till the end of the task - and there's no need to attempt this neither: The OS variant
 * of the function doesn't involve the overhead of a system call and no execution time
 * would be saved as for the user variant.
 *   @remark
 * This function must be called from OS tasks only. Any attempt to use it from either an
 * ISR or in user mode code will lead to either a failure or privileged exception,
 * respectively.
 *   @remark
 * This function requires that msr[EE]=1 on entry.
 */
void rtos_osResumeAllTasksByPriority(uint32_t resumeDownToThisTaskPriority)
{
    rtos_kernelInstanceData_t * const pIData = rtos_osGetInstancePtr();
    if(resumeDownToThisTaskPriority < pIData->currentPrio)
    {
        /* Identify the events, which could possibly require the recursive call of the
           scheduler.
             Note, there is a significant difference in the implementation here for the OS
           tasks and the system call that implements the same concept for the user tasks.
           The OS code just identifies the events that may have been triggered meanwhile
           and calls the scheduler to let it decide whether there's really something to do.
           Often, this won't be the case. (Which is possible for the other reason, too,
           that the check code is not inside the critical section).
             The system call implementation really figures out whether there is at least
           one event that requires scheduling. It looks at the state of all possible
           candidates. Effectively, it re-implements part of the scheduler itself. The
           reason is the significant overhead, which results from calling a C function from
           a system call. In the majority of cases, the system call will find that calling
           the scheduler is not needed so that this effectively is a significant
           optimization. The OS code here would not benefit from the same strategy. */
        rtos_eventDesc_t * const pEvToSchedulePossibly = 
                                                rtos_osGetEventByPriority(pIData->currentPrio);
        pIData->currentPrio = resumeDownToThisTaskPriority;

