PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/RTOS/rtos_scheduler.c
        rtos_osSuspendAllInterrupts();
        /* Note, because check and change of the current prio are not inside the critical
           section it can easily be that the call of the scheduler is already obsolete.
           This doesn't matter, not even with respect to overhead and the number of
           function invocations. Not taking check and change into the CS just means to have
           a smaller CS. */
        rtos_osProcessTriggeredEvents(pEvToSchedulePossibly);
        rtos_osResumeAllInterrupts();
    }
} /* rtos_osResumeAllTasksByPriority */



/**
 * An event, which becomes due may not be able to activate all its associated tasks because
 * they didn't terminate yet after their previous activation. It doesn't matter if this
 * happens because a cyclic task becomes due or because an event task has been triggered by
 * software (using rtos_triggerEvent()). The scheduler counts the failing activations on a
 * per event base. The current value can be queried with this function.
 *   @return
 * Get the current number of triggers of the given event, which have failed since start of
 * the RTOS scheduler. The counter is saturated and will not wrap around.\n
 *   The returned count can be understood as number of task overrun events for all
 * associated tasks.
 *   @param idEvent
 * Each event has its own counter. The value is returned for the given event. The range is 0
 * .. number of registered events minus one (double-checked by assertion).
 *   @remark
 * This function can be called from both, the OS context and a user task.
 */
unsigned int rtos_getNoActivationLoss(unsigned int idEvent)
{
    const rtos_kernelInstanceData_t * const pIData = rtos_ugetInstancePtr();
    if(idEvent < pIData->noEvents)
    {
        const rtos_kernelInstanceData_t * const pIData = rtos_ugetInstancePtr();
        assert(idEvent < pIData->noEvents);
        const rtos_eventDesc_t *pEvent = pIData->mapEventIDToPtr[idEvent];
        return pEvent->noActivationLoss;
    }
    else
    {
        assert(false);
        return UINT_MAX;
    }
} /* End of rtos_getNoActivationLoss */



/**
 * A cyclic or event task can query its base priority.
 *   @return
 * Get the base priority of the task, which calls this function. It's the priority of the
 * event it is associated with.
 *   @remark
 * The function is quite similar to rtos_getCurrentBasePriority() but this function
 * considers temporary changes of the priority of a task because of the use of the PCP API.
 * For one and the same task, it is rtos_getCurrentPriority() >
 * rtos_getCurrentBasePriority().
 *   @remark
 * This function can be called from an OS task only. Any attempt to call it from a user
 * task will cause a privileged exception.
 *   @remark
 * The function must not be called from an ISR. The result would be undefined as there is
 * no event, which such a handler function would be associated with. However, with respect
 * to safety or stability, there's no problem in doing this.
 */
unsigned int rtos_osGetTaskBasePriority(void)
{
    const rtos_kernelInstanceData_t * const pIData = rtos_osGetInstancePtr();
    return pIData->pCurrentEvent->priority;

} /* End of rtos_osGetTaskBasePriority */


#if 0
/**
 * A task can query the current task scheduling priority.
 *   @return
 * Get the current priority of the task, which calls this function.
 *   @remark
 * The function is quite similar to rtos_osGetTaskBasePriority() but this function
 * considers temporary changes of the priority of a task because of the use of the PCP API.
 * For one and the same task, it is rtos_getCurrentTaskPriority() >
 * rtos_osGetTaskBasePriority().
 *   @remark
 * This function can be called from both, an OS or a user task.
 *   @remark
 * The function must not be called from an ISR or from a callback, which is started by an
 * ISR and using the service rtos_osRunTask(). The result would be undefined as there is no
 * event, which such a function would be associated with. However, with respect to safety
 * or stability, there's no problem in doing this and therefore no privileges have been
 * connected to this service.
 */
unsigned int rtos_getCurrentTaskPriority(void)
{
    const rtos_kernelInstanceData_t * const pIData = rtos_getInstancePtr();
    return (unsigned int)pIData->currentPrio;

} /* End of rtos_getCurrentTaskPriority */
#endif